// Написати функцію, яка на вхід отримую число у форматі строки та повертає його у форматі числа, аналог методу parseInt(). 
// Використовувати будь-які вбудовані функції заборонено, тільки власний код!
// Приклади роботи функції: (вхідні дані -> результат роботи):

// '15' -> 15

// '376' -> 376

// '100500' -> 100500

// Підказка: будь-яке число можна зобразити через систему числення з основою 10. Так, число 7 є 7 * (10^0), число 21: 2 * (10^1) + 1 * (10^0), а число 100 є 1 * (10^2). 
// Конвертувати ж строкове однорозрядне  число можна за допомогою операції модульного ділення на основу ('число' % 10), або побітового OR з 0 ('число' | 0).

// Додаткове питання: що потрібно змінити, аби можна було задавати строку та довільну систему числення? 
// Тобто, наприклад, для виклику функції з аргументами ('101', 2) результатом її роботи було число 5 (задане строкове значення переводимо у число з використанням системи числення з основою
//      2), з аргументами ('101', 5) результатом буде число 26 (система числення з осново 5), а з аргументами ('101', 8) отримуємо 65 (система числення з основою 8).

// Для спрощення рішення, система числення може бути довільна, але не більша 10, оскільки це потребуватиме більш складного рішення 
// (наприклад, для системи числення з основою 16 потрібно додатково зберігати символьні коди для значень від 10 до 16).


function changeType() {
    const stringValue = prompt('Введіть будь ласка число?');
    const changeTypeMethod = +stringValue;
    const checkThePrompt = /[a-zA-Z]/;

    if (stringValue === '') {
        alert('Поле є пусте, нічого робити не буду');
        return;
    } else if (checkThePrompt.test(stringValue)) {
        alert('Приймаю тільки цифри!!!');
        return;
    }

    console.log(`Тип: ${typeof changeTypeMethod}\nТвоє значення: ${changeTypeMethod}`);
}

changeType(); // функція приймає строку, є перевірка на букви , при вказанні будь - якого числового значення = повернеться тип number.

// -----------------------------------------------------

// і просто для цікавості , функціюя яка приймає рядок і основу системи числення, та повертає відповідне число.

function convertToDecimal(str, base) {

    const decimalValue = parseInt(str, base); // не втримався, і юзанув parseInt() | :D

    if (isNaN(decimalValue)) {
        console.log("Неправильний формат числа для даної системи числення");
        return;
    }

    return decimalValue;
}

console.log(convertToDecimal('101', 2)); // Виведе 5
console.log(convertToDecimal('101', 5)); // Виведе 26
console.log(convertToDecimal('101', 8)); // Виведе 65

