'use strict'

// №1: Гра Вгадай число
// Напишіть невеличку гру, яка за допомогою браузерної команди prompt() буде запитувати користувача ввести будь-яке число. Далі потрібно перевірити:

// Якщо число більше або дорівнює 123 - програма зупиняється, виводячи текстове повідомлення Wow, you've ended this endless cycle!;
// Якщо введене число менше від 123 - вивести текстове Should continue та продовжувати запитувати користувача про введення далі;
// Якщо користувач ввів не числове значення - вивести текстове повідомлення Only numbers, please та знову запитувати ввести значення.

while (true) {

    let userInput = prompt("Введіть будь-яке число:");

    if (isNaN(userInput)) {
        alert("Тільки числа, будь ласка!");
    } else {
        if (parseInt(userInput) >= 123) {
            alert("Wow, you've ended this endless cycle!");
            break;
        } else {
            alert("Should continue");
        }
    }
}


// -----------------------------------------------------------------------------------------------
