/* Яким буде результат виконання кожної з наступних строк коду та чому? Напишіть відповіді для кожної строки коду та коротке пояснення.*/

'12' + 34  // ? відповідь буде 1234 , тому що маємо + і буде просто конкатинація в рядок : тип string 
12 + 34    // ? відповідь буде 46 , здійснюється звичайне додавання : тип number
100 / '10' // ? відповідь буде 10 , оскільки буде виконано математичний вираз , при діленні , множенні , тощо . Js - намагається автоматично строку перевести в відповідний тип для обчислення.
100 * 'f'  // ? відповідь буде NaN, оскільки обчислення не можливе , строка тримає значення "f" що неможливо помножити на 100.
'7' / null // ? відповідь буде infinity , так як ми намагаємось поділити 7 (як число) на null , який явлає значення в цьому випадку : Number.POSITIVE_INFINITY і повертає значення : infinity


// Нижче наведено дані та результат, який потрібно отримати (після стрілочки ->). Напишіть код для отримання заданого результату (всі відомі вам варіанти):

// '2' + '4' -> 6 (алгебраїчна сума)
// 7.2 / '1.2' -> 6 (ділення двох чисел)
// 'this' + ' simple' + ' string' -> 'this simple string' (конкатенація строк)
// 'answer' + ' is:' + '30' + 5 -> 'answer is 35' (сума з конкатенацією)

const a = Number('2') + Number('4'); // можна відразу зробити значення мутабельними, і перевести їх в числа
const a_second = '2' + '4';
let ab = a_second / 4; // другий варіант , ми отримуємо строку - "24" і пишемо вирах "24" / 4 = 6; js - переведе строку в числове значення 
console.log(ab);
console.log(a);

//-----------------------------------------------

const b = 7.2 / '1.2'; // тут нічого робити не треба , результатом буде (6) тип number. js - сам переведе строку в число, оскільки це вираз ділення.
console.log(b);

//-----------------------------------------------

const plusString = 'this' + ' simple' + ' string';
console.log(plusString); // тут теж нічого не треба робити, плюси роблять конкатинацію 

//-----------------------------------------------
const numberPlusString = Number('30') + 5; // тут отримуємо 35 , метод Number перетворює cтроку "30" в число.

console.log(`answer is: ${numberPlusString}`); 