// Паліндром - це така строка, яка має в собі "дзеркальні" символи (перший символ = останній символ, другий символ = передостанньому символу і т.д.). 
// Приклади паліндромів: Анна, піп, mom, nun, taco cat.

// Написаті функцію, яка на вхід отримує строку довільного розміру та повертає true, якщо задана строка є паліндромом. 
// Інакше повернути false. 
// Використовувати будь-які вбудовані функції заборонено, тільки власний код!

// Приклади роботи функції (вхідна строка -> результат роботи):

// '' -> false

// 'b' -> true

// 'mom' -> true

// 'string' -> false

// 'bag' -> false

// Підказка: потрібно порівнювати символи від початку та з кінця.

console.log(`----------------------------------------------------------`);

function isPalindrome() {
    let str = prompt('Введіть слово або речення:');
    str = str.replace(/\s/g, '').toLowerCase();

    if (str.length <= 1) {
        alert('Введений рядок не може бути паліндромом.');
        return;
    }

    for (let i = 0, j = str.length - 1; i < j; i++, j--) {
        if (str[i] !== str[j]) {
            alert('Введений рядок не є паліндромом.');
            return;
        }
    }

    alert('Введений рядок є паліндромом.');
}

isPalindrome();
