// Написати функцію, яка на вхід отримує масив чисел довільного порядку (не сортовані) та довільної довжини з N елементів, та повертає значення найменшого числа в цьому масиві. 
// Для спрощення рішення розуміємо, що на вхід отримуємо масив, що завжди складається тільки з чисел. 
// Якщо заданий масив пустий (немає жодного елементу) - повернути null. 
// Використовувати будь-які вбудовані функції заборонено, тільки власний код!

// Приклади роботи: (вхідні дані -> результат роботи функції)

// [1, 7, 5, 6, 0] -> 0

// [3, 1, -9, -3, 2, 8] -> -9

// Підказка: потрібно перебрати весь масив.

// Додаткове питання: що треба змінити в функції, аби замість мінімального значення вона шукала максимальне? А якщо одразу шукати і мінімальне, і максимальне значення?


const num = [15 , 12 , 44 , 555 , 17 , 3.14]

function searchLessNumber (num) {
    console.log(num);
    let min = num[0];
    let max = num[0]
    const contentCheck = (num.length === 0) ? alert(null) : console.log('Array is valid');


    for (item of num) {
        if(item < min) {
            min = item;
        }  else if (item > max) {
            max = item;
        }
    }

    return console.log(`--- Найменше число ${min} \n -- Найбільше число ${max}` );

}
searchLessNumber(num);

